rottenpotatoes/app/controllers/movies_controller.rb

   def similar
     @movie, @movies, error = Movie.find_with_same_director(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]